#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...
github_team_membership.platform["Flowlance"]: Refreshing state... [id=9668083:Flowlance]
github_team_membership.platform["FredrikMelby"]: Refreshing state... [id=9668083:FredrikMelby]
github_team_membership.platform["xQseb"]: Refreshing state... [id=9668083:xQseb]
github_team_membership.platform["KA-T1"]: Refreshing state... [id=9668083:KA-T1]
github_team_membership.platform["MrNewgarden"]: Refreshing state... [id=9668083:MrNewgarden]
github_team_membership.platform["maos999"]: Refreshing state... [id=9668083:maos999]
github_team_membership.platform["fabskab"]: Refreshing state... [id=9668083:fabskab]
github_team_membership.platform["antnsn"]: Refreshing state... [id=9668083:antnsn]
github_team_membership.platform["johnrosbe"]: Refreshing state... [id=9668083:johnrosbe]
github_team.platform: Refreshing state... [id=9668083]
github_team.all_users: Refreshing state... [id=9665234]
github_membership.admin["molldk"]: Refreshing state... [id=CMCS-Norway:molldk]
github_membership.admin["johnrosbe"]: Refreshing state... [id=CMCS-Norway:johnrosbe]
github_membership.admin["MrNewgarden"]: Refreshing state... [id=CMCS-Norway:MrNewgarden]
github_membership.admin["GlennIsb"]: Refreshing state... [id=CMCS-Norway:GlennIsb]
github_membership.admin["Flowlance"]: Refreshing state... [id=CMCS-Norway:Flowlance]
github_membership.admin["antnsn"]: Refreshing state... [id=CMCS-Norway:antnsn]
github_membership.admin["AndersLevin-GroupIT"]: Refreshing state... [id=CMCS-Norway:AndersLevin-GroupIT]
github_membership.admin["Tjacsen"]: Refreshing state... [id=CMCS-Norway:Tjacsen]
github_membership.admin["maos999"]: Refreshing state... [id=CMCS-Norway:maos999]
github_membership.admin["FredrikMelby"]: Refreshing state... [id=CMCS-Norway:FredrikMelby]
github_membership.users["CMCS-PerH"]: Refreshing state... [id=CMCS-Norway:CMCS-PerH]
github_membership.users["KA-T1"]: Refreshing state... [id=CMCS-Norway:KA-T1]
github_membership.users["trymhaak"]: Refreshing state... [id=CMCS-Norway:trymhaak]
github_membership.users["vagnes"]: Refreshing state... [id=CMCS-Norway:vagnes]
github_membership.users["fabskab"]: Refreshing state... [id=CMCS-Norway:fabskab]
github_membership.users["xQseb"]: Refreshing state... [id=CMCS-Norway:xQseb]
github_membership.users["emilihoo"]: Refreshing state... [id=CMCS-Norway:emilihoo]
github_membership.users["irean"]: Refreshing state... [id=CMCS-Norway:irean]
github_membership.users["kojarB"]: Refreshing state... [id=CMCS-Norway:kojarB]
github_membership.users["Danielbj01"]: Refreshing state... [id=CMCS-Norway:Danielbj01]
github_membership.users["Hawolex"]: Refreshing state... [id=CMCS-Norway:Hawolex]
github_membership.users["jenaslak"]: Refreshing state... [id=CMCS-Norway:jenaslak]
github_team_membership.all_users["xQseb"]: Refreshing state... [id=9665234:xQseb]
github_team_membership.all_users["irean"]: Refreshing state... [id=9665234:irean]
github_team_membership.all_users["Danielbj01"]: Refreshing state... [id=9665234:Danielbj01]
github_team_membership.all_users["MrNewgarden"]: Refreshing state... [id=9665234:MrNewgarden]
github_team_membership.all_users["johnrosbe"]: Refreshing state... [id=9665234:johnrosbe]
github_team_membership.all_users["FredrikMelby"]: Refreshing state... [id=9665234:FredrikMelby]
github_team_membership.all_users["GlennIsb"]: Refreshing state... [id=9665234:GlennIsb]
github_team_membership.all_users["emilihoo"]: Refreshing state... [id=9665234:emilihoo]
github_team_membership.all_users["Flowlance"]: Refreshing state... [id=9665234:Flowlance]
github_team_membership.all_users["CMCS-PerH"]: Refreshing state... [id=9665234:CMCS-PerH]
github_team_membership.all_users["antnsn"]: Refreshing state... [id=9665234:antnsn]
github_team_membership.all_users["jenaslak"]: Refreshing state... [id=9665234:jenaslak]
github_team_membership.all_users["maos999"]: Refreshing state... [id=9665234:maos999]
github_team_membership.all_users["AndersLevin-GroupIT"]: Refreshing state... [id=9665234:AndersLevin-GroupIT]
github_team_membership.all_users["fabskab"]: Refreshing state... [id=9665234:fabskab]
github_team_membership.all_users["kojarB"]: Refreshing state... [id=9665234:kojarB]
github_team_membership.all_users["KA-T1"]: Refreshing state... [id=9665234:KA-T1]
github_team_membership.all_users["Hawolex"]: Refreshing state... [id=9665234:Hawolex]
github_team_membership.all_users["Tjacsen"]: Refreshing state... [id=9665234:Tjacsen]
github_team_membership.all_users["vagnes"]: Refreshing state... [id=9665234:vagnes]
github_team_membership.all_users["molldk"]: Refreshing state... [id=9665234:molldk]
github_team_membership.all_users["trymhaak"]: Refreshing state... [id=9665234:trymhaak]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # github_team.devops will be created
  + resource "github_team" "devops" {
      + create_default_maintainer = false
      + description               = "platform team members."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "platform"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.platform will be destroyed
  # (because github_team.platform is not in configuration)
  - resource "github_team" "platform" {
      - create_default_maintainer = false -> null
      - description               = "platform team members." -> null
      - etag                      = "W/\"a6aeeb3d1b307672b81d2d710bcd0e8f1fa4f7da8dae513bc7616182918365f5\"" -> null
      - id                        = "9668083" -> null
      - members_count             = 9 -> null
      - name                      = "platform" -> null
      - node_id                   = "T_kwDOBsbH_84Ak4Xz" -> null
      - privacy                   = "closed" -> null
      - slug                      = "platform" -> null
    }

  # github_team.security will be created
  + resource "github_team" "security" {
      + create_default_maintainer = false
      + description               = "Security team members."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Security"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.devops["Flowlance"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "Flowlance"
    }

  # github_team_membership.devops["FredrikMelby"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "FredrikMelby"
    }

  # github_team_membership.devops["KA-T1"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "KA-T1"
    }

  # github_team_membership.devops["MrNewgarden"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "MrNewgarden"
    }

  # github_team_membership.devops["antnsn"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "antnsn"
    }

  # github_team_membership.devops["fabskab"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "fabskab"
    }

  # github_team_membership.devops["johnrosbe"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "johnrosbe"
    }

  # github_team_membership.devops["maos999"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "maos999"
    }

  # github_team_membership.devops["xQseb"] will be created
  + resource "github_team_membership" "devops" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xQseb"
    }

  # github_team_membership.platform["Flowlance"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"a6f1417b3c85d63154f3e76f1b4f6893eae44cd27f93e049cb412494de979385\"" -> null
      - id       = "9668083:Flowlance" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "Flowlance" -> null
    }

  # github_team_membership.platform["FredrikMelby"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"c9d972f144028e80f12d968a9cc1fed8f776ea924fd156b17447b1674c1877bb\"" -> null
      - id       = "9668083:FredrikMelby" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "FredrikMelby" -> null
    }

  # github_team_membership.platform["KA-T1"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"0531ba106064457e8a8871194bd4c2f97d0fc27628f8b43f8b9648ed27b67f58\"" -> null
      - id       = "9668083:KA-T1" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "KA-T1" -> null
    }

  # github_team_membership.platform["MrNewgarden"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"f8a13e8ca1a2cfd09544d9bf1461ea945864e4c7fe209631f2d13d7489e3e28d\"" -> null
      - id       = "9668083:MrNewgarden" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "MrNewgarden" -> null
    }

  # github_team_membership.platform["antnsn"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"4ed4b68b70691170da4a33857b7c0684a70e3cf6991e8145ea4e5195522710ec\"" -> null
      - id       = "9668083:antnsn" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "antnsn" -> null
    }

  # github_team_membership.platform["fabskab"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"77d1413e4452072d2b8fa636ab71b1450cc6d4dd2c8c888edd73caa7a538db6c\"" -> null
      - id       = "9668083:fabskab" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "fabskab" -> null
    }

  # github_team_membership.platform["johnrosbe"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"e86d37019714a5f19d21ebe4b3d40a4e72a7352079cbdbbe1a699365609f7f7d\"" -> null
      - id       = "9668083:johnrosbe" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "johnrosbe" -> null
    }

  # github_team_membership.platform["maos999"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"67025f4005c390371d5a70bd79726bf6eb17fd648d8eca4a882c45436044fb0b\"" -> null
      - id       = "9668083:maos999" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "maos999" -> null
    }

  # github_team_membership.platform["xQseb"] will be destroyed
  # (because github_team_membership.platform is not in configuration)
  - resource "github_team_membership" "platform" {
      - etag     = "W/\"04188274d96dcd7c6f2932ac3cb28d5df025e8054323998fd7a9e79a7a0fdb68\"" -> null
      - id       = "9668083:xQseb" -> null
      - role     = "maintainer" -> null
      - team_id  = "9668083" -> null
      - username = "xQseb" -> null
    }

  # github_team_membership.security["irean"] will be created
  + resource "github_team_membership" "security" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "irean"
    }

  # github_team_membership.security["kojarB"] will be created
  + resource "github_team_membership" "security" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "kojarB"
    }

  # github_team_membership.security["trymhaak"] will be created
  + resource "github_team_membership" "security" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "trymhaak"
    }

  # github_team_membership.security["vagnes"] will be created
  + resource "github_team_membership" "security" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "vagnes"
    }

Plan: 15 to add, 0 to change, 10 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @antnsn, Action: `pull_request`*